app/views/orders/allorders.html.erb

	<div class="large-1 columns">
				  <img src="/img/<%= Product.find(ord.product_id).id %>.jpg">
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

		<div class="large-2 columns text-left">
		 	<h4 class="final1"> Order by</h4> <h3 class="final"><%= User.find(ord.user_id).first_name %></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 14]]