app/views/orders/showorder.html.erb

	<div class="large-3 columns">
		<h3><%= Product.find(@order.product_id).name %></h3>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]