app/controllers/orders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-12-16 11:05:54.957392"], ["updated_at", "2015-12-16 11:05:54.957392"]]
UPDATE "orders" SET "user_id" = ?, "product_id" = ?, "count" = ?, "price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["user_id", "14"], ["product_id", "1"], ["count", 1], ["price", 400.0], ["updated_at", "2015-12-16 11:36:39.794687"], ["id", 4]]
UPDATE "products" SET "count" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["count", 0], ["updated_at", "2015-12-16 13:48:01.468423"], ["id", 3]]
---
	def index

		user = User.find(current_user)

		session[:buy_product].each do |ses|

			product = Product.find(ses[0])

			if ses[1]>product.count
				flash[:orderedd] = "OOPS! Your count of some product bigger that max count! Please, correct this"
				break
			end

			order = Order.create()

			order.user_id = user.id

			order.product_id = product.id

			order.count = ses[1]

			order.price = product.price*ses[1]

			order.save

SELECT "orders".* FROM "orders" WHERE (user_id = current_user.id)
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? LIMIT 1  [["user_id", "14"]]
---
	def allorders

		if current_user.admin
			@orders = Order.all
		else
		@orders=Order.where("user_id = ?", current_user.id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 30]]
---
	def showorder

		@order=Order.find(params[:id].to_i)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 34]]
---
	def update

		order = Order.find(params[:id].to_i)