app/controllers/products_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 14]]
---
  def sh
  	@ses=User.find(current_user)