app/controllers/products_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products"
---
	def index
		  @user=User.find(sign_id)
		@products=Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]
---
  def addtocart
    product = Product.find(params[:id])

SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."id" IN (1, 3, 4, 3, 1, 1, 4) LIMIT 1
---
  def showcart

i=0
@cart=Array.new
   if session[:buy_product] && session[:buy_product].size>0

	session[:buy_product].each do |ses|
		# (@cart ||= []) << Product.find(ses[0])

		@cart[i] = Array.new(2)
		@cart[i][0] = Product.find(ses[0])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 0]]
---
def edit

	@product = Product.find(params[:id].to_i)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "name" = ?, "count" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", nil], ["count", nil], ["price", nil], ["updated_at", "2015-12-21 11:24:05.697821"], ["id", 1]]
---
def update

	product = Product.find(params[:id].to_i)

	product.name = params[:product][:name]

	product.count = params[:product][:count]

	product.price = params[:product][:price]

	product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 5]]
---
	def delete

		Product.delete(params[:id].to_i)

INSERT INTO "products" ("name", "price", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "новый товар"], ["price", 111111.0], ["count", 1], ["created_at", "2015-12-21 11:54:46.392990"], ["updated_at", "2015-12-21 11:54:46.392990"]]
---
  	def create
  		 product = Product.create(name: params[:product][:name], price: params[:product][:price], count: params[:product][:count] )