app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def alusers
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 18]]
---
    def update

      user = User.find(params[:id].to_i)

INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?)
---
def create
    @user = User.new(user_params)
    if @user.save